src/Reports/ВыработкаРаботниковОрганизаций/ВыработкаРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВыработкаРаботниковОрганизаций</name>
  <attributes>
    <name>ОбщийОтчет</name>
    <type>
      <types>ReportObject.ОтчетСписокКроссТаблица</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширеннаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтрицательноеКрасным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПериода</name>
  </attributes>
  <attributes>
    <name>ПоказыватьБыстрыйОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

src/Enums/СпособыРасчетаОплатыТруда/СпособыРасчетаОплатыТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаОплатыТруда</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ДоплатаЗаВечерниеЧасы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>АлиментыПроцентомДоПредела</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>АлиментыФиксСуммой</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>АлиментыФиксСуммойДоПредела</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>Взносы</name>
    <comment>Взносы, которые перечисляются работниками</comment>
  </enumValues>
  <enumValues>
    <name>ВзносыФОТ</name>
    <comment>Взносы, которые перечисляет организация на ФОТ</comment>
  </enumValues>
  <enumValues>
    <name>ВыслугаЛет</name>
  </enumValues>
  <enumValues>
    <name>ГосударственноеПособие</name>
  </enumValues>
  <enumValues>
    <name>АлиментыПроцентом</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаНочныеЧасы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПочтовыйСбор</name>
  </enumValues>
  <enumValues>
    <name>Замена</name>
  </enumValues>
  <enumValues>
    <name>ИндексацияЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ИндексацияСоциальныхНачислений</name>
  </enumValues>
  <enumValues>
    <name>ИсполнителныйЛистСУчетомОграничения</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистПроцентом</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистПроцентомДоПредела</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистФиксСуммой</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистФиксСуммойДоПредела</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацияНевыплаченнойЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>НулеваяСумма</name>
    <comment>(Общ) ВР без расчета результата</comment>
  </enumValues>
  <enumValues>
    <name>ПоДневнойТарифнойСтавке</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоМесячнойТарифнойСтавкеПоДням</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоМесячнойТарифнойСтавкеПоЧасам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоЧасовойТарифнойСтавке</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработка</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработку</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуДляОтпуска</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ПоЧасовойТарифнойСтавкеУмножитьНаПроцент</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуФСС</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>Процентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СдельныйЗаработок</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВыходноеПособие</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуКомпенсацияОтпуска</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуВозвратОтпуска</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ПоДоговоруФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>ФиксированнойСуммой</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяФормула</name>
  </enumValues>
</mdclass:Enum>

src/Reports/ВыработкаРаботниковОрганизаций/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки          Экспорт;

#Если Клиент ИЛИ ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует отчет в табличный документ
//
// Параметры:
//  Результат         - табличный документ куда будет сформирован отчет
//  ДанныеРасшифровки - данные расшифровки отчета схемы компоновки данных
//  ВыводВФормуОтчета - признак вывода отчета в форму  
//
Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
	
	Возврат ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета);
	
КонецФункции //СформироватьОтчет()
	
// В процедуре можно доработать компоновщик перед выводом в отчет
//
// Параметры:
//  Нет.
//
Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
	
	ТЗ = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	     |	ОсновныеНачисленияОрганизацийПоказатели.Ссылка КАК ВидРасчета,
	     |	ОсновныеНачисленияОрганизацийПоказатели.НомерСтроки
	     |ИЗ
	     |	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК ОсновныеНачисленияОрганизацийПоказатели
	     |ГДЕ
	     |	ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.СдельнаяВыработка)
	     |	И (НЕ ОсновныеНачисленияОрганизацийПоказатели.Ссылка.ПометкаУдаления)
	     |
	     |ОБЪЕДИНИТЬ
	     |
	     |ВЫБРАТЬ РАЗЛИЧНЫЕ
	     |	ОсновныеНачисленияОрганизаций.Ссылка,
	     |	NULL
	     |ИЗ
	     |	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
	     |ГДЕ
	     |	ОсновныеНачисленияОрганизаций.Ссылка.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.СдельныйЗаработок)
	     |	И (НЕ ОсновныеНачисленияОрганизаций.ПометкаУдаления)
	     |";
		 
	Запрос = Новый Запрос(ТЗ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокВидовРасчета = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		Если "ИсходныеДанные.Показатель"+Выборка.НомерСтроки = СокрЛП(Выборка.ВидРасчета.ФормулаРасчета) тогда
			СписокВидовРасчета.Добавить(Выборка.ВидРасчета);
		ИначеЕсли Выборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок тогда
			СписокВидовРасчета.Добавить(Выборка.ВидРасчета);
		КонецЕсли;
	КонецЦикла;
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ВидыРасчета", СписокВидовРасчета);

	
КонецПроцедуры //ДоработатьКомпоновщикПередВыводом()

#КонецЕсли

#Если Клиент Тогда

// Настройка отчета
//
// Параметры:
//  Отбор                              - отбор компоновки данных
//  КомпоновщикНастроекОсновногоОтчета - компоновщик настроек
//
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	
КонецПроцедуры //Настроить()

// Сохраняет настройки отчета
//
// Параметры:
//  Нет.
//
Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры //СохранитьНастройку()

// Заполняет параметры отчета по элементу справочника из переменной "СохраненнаяНастройка".
//
// Параметры:
//  Нет.
//
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры //ПрименитьНастройку()

// Инициализация отчета
//
// Параметры:
//  Нет.
//
Процедура ИнициализацияОтчета() Экспорт
	
	ТиповыеОтчеты.ИнициализацияТиповогоОтчета(ЭтотОбъект);
	
КонецПроцедуры //ИнициализацияОтчета()

Расшифровки = Новый СписокЗначений;

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
